import { DataTimePeriod } from '@/common/types/DataTimePeriod';

export const dataTimePeriods: DataTimePeriod[] = [
    {
        title: 'Технологии',
        events: [
            {
                date: 1989,
                description: 'Изобретение World Wide Web Тимом Бернерсом-Ли',
            },
            {
                date: 1990,
                description: 'Первый веб-браузер WorldWideWeb',
            },
            {
                date: 1991,
                description: 'Первый веб-сайт info.cern.ch',
            },
            {
                date: 1992,
                description: 'Появление первого смартфона IBM Simon',
            },
            {
                date: 1993,
                description: 'Создание первого графического веб-браузера Mosaic',
            },
            {
                date: 1994,
                description: 'Основание компании Amazon',
            },
        ],
    },
    {
        title: 'Кино',
        events: [
            {
                date: 1995,
                description: 'Премьера фильма "Той-стори" - первого полнометражного компьютерного анимационного фильма',
            },
            {
                date: 1996,
                description: 'Выход фильма "День независимости" - эталона блокбастеров',
            },
            {
                date: 1997,
                description: 'Премьера "Титаника" - рекордсмена по "Оскарам"',
            },
            {
                date: 1998,
                description: 'Выход "Спасти рядового Райана" - революция в батальных сценах',
            },
            {
                date: 1999,
                description: 'Премьера "Матрицы" - новая эра спецэффектов',
            },
            {
                date: 2000,
                description: 'Выход "Гладиатора" - возрождение жанра пеплумов',
            },
        ],
    },
    {
        title: 'Литература',
        events: [
            {
                date: 2001,
                description: 'Публикация "Хари Поттер и философский камень" на русском языке',
            },
            {
                date: 2002,
                description: 'Выход "Идиота" в новой редакции (к 150-летию Достоевского)',
            },
            {
                date: 2003,
                description: 'Нобелевская премия по литературе Джону Кутзее',
            },
            {
                date: 2004,
                description: 'Публикация "Кода да Винчи" Дэна Брауна',
            },
            {
                date: 2005,
                description: 'Выход "Детей Арбата" Анатолия Рыбакова',
            },
            {
                date: 2006,
                description: 'Нобелевская премия Орхану Памуку',
            },
        ],
    },
    {
        title: 'Театр',
        events: [
            {
                date: 2007,
                description: 'Премьера мюзикла "Зорро" в Лондоне',
            },
            {
                date: 2008,
                description: 'Открытие театра "Практика" в Москве',
            },
            {
                date: 2009,
                description: 'Премьера "Гамлета" с Дэвидом Теннантом',
            },
            {
                date: 2010,
                description: 'Реставрация исторической сцены Большого театра',
            },
            {
                date: 2011,
                description: 'Премьера спектакля "Борис Годунов" в МХТ',
            },
            {
                date: 2012,
                description: 'Открытие театрального центра "На Страстном"',
            },
        ],
    },
    {
        title: 'Спорт',
        events: [
            {
                date: 2013,
                description: 'Чемпионат мира по легкой атлетике в Москве',
            },
            {
                date: 2014,
                description: 'Чемпионат мира по футболу в Бразилии',
            },
            {
                date: 2015,
                description: 'Чемпионат мира по легкой атлетике в Пекине',
            },
            {
                date: 2016,
                description: 'Летние Олимпийские игры в Рио-де-Жанейро',
            },
            {
                date: 2017,
                description: 'Кубок Конфедераций в России',
            },
            {
                date: 2018,
                description: 'Чемпионат мира по футболу в России',
            },
        ],
    },
    {
        title: 'Наука',
        events: [
            {
                date: 2019,
                description: 'Первое изображение черной дыры',
            },
            {
                date: 2020,
                description: 'Разработка вакцин от COVID-19',
            },
            {
                date: 2021,
                description: 'Испытания квантового компьютера',
            },
            {
                date: 2022,
                description: 'Запуск телескопа "Джеймс Уэбб"',
            },
            {
                date: 2023,
                description: 'Прорыв в термоядерном синтезе',
            },
            {
                date: 2024,
                description: 'Искусственный интеллект AlphaFold 3',
            },
        ],
    },
];
